site/content/reveal/03/_index.md
+++
draft = false
outputs = "Reveal"
+++

## Занятие №3 {#занятие-3}

Функции

---

Что такое функция?

---

Какие функции мы уже рассматривали?

---


### Понятие {#понятие}

В программировании, функция &mdash; это последовательность совершающих вычисление инструкций, имеющая имя.

---


### Вызов функций {#вызов-функций}

```text
имя_функции(аргумент1, аргумент2, ...)
```

---

```python
>>> type(42)
<class 'int'>
```

Имя функции, аргумент, возвращаемое значение (return value)

---


### Математические функции {#математические-функции}

Подключение модуля:

```python
>>> import math
```

Инструкция импорта.

Объект-модуль

---

Dot notation (запись с точками):

`math.pi` и `math.sqrt()`

---


### Композиция {#композиция}

Аргументом функции может быть любое выражение.

```python
print(dir(math))
```

```python
minutes = hours * 60
```

---


### Создание новых функций {#создание-новых-функций}

<https://docs.python.org/3/reference/compound%5Fstmts.html#function-definitions>

```text
funcdef       ::=  [decorators] "def" funcname "(" [parameter_list] ")"
                   ["->" expression] ":" suite
```

```text
Определение функции       ::=  "def" имя_функции "(" [список_аргументов] ")"
                    ":" список инструкций
```

---

```python
def print_something():
    print('Я печатаю некоторый текст')
    print('на двух строчках.')
```

Пустые скобки означают, что функция не принимает аргументов.

Заголовок и тело функции.

Тело начинается с отступа. Отступ &mdash; 4 пробела. Тело может содержать любое количество инструкций.

---

```python
>>> print(print_something)
>>> type(print_something)
```

---

Вызывать новые функции можно так же, как и встроенные.

---

После определения, новые функции можно использовать в других функциях.

```python
def repeat_something():
    print_something()
    print_something()
```

```python
>>> repeat_something()
```

---


### Определение и использование функций {#определение-и-использование-функций}

```python
def print_something():
    print('Я печатаю некоторый текст')
    print('на двух строчках.')

def repeat_something():
    print_something()
    print_something()

repeat_something()
```

---

Инструкции внутри функции не выполняются до ее вызова. Прежде чем использовать функции, их необходимо создать.

---


### Аргументы и параметры {#аргументы-и-параметры}

```python
def print_twice(bruce):
    print(bruce)
    print(bruce)
```

---

Переменные и параметры локальны.

```python
def cat_twice(part1, part2):
    cat = part1 + part2
    print_twice(cat)
```

---

```python
>>> line1 = 'Bing tiddle '
>>> line2 = 'tiddle bang.'
>>> cat_twice(line1, line2)
```

```python
>>> print(cat)
```

---

Не все функции возвращают какое-то значение

```python
>>> result = print_twice('Bing')
Bing
Bing
>>> print(result)
None
```

---


### Задачи {#задачи}

---


### №1 {#1}

Напишите функцию `right_justify`, которая принимает строку, названную `s` в качестве аргумента и выводит в консоль строку с достаточным количеством пробелов перед ней, таким образом, что ее последний символ находится в 70-ом столбце дисплея.

---


### №2 {#2}

Предисловие.

Объект функция является значением, которое можно назначать переменной или использовать в качестве аргумента других функций. Например, `do_twice` &mdash; это функция, которая принимает объект функцию в качестве аргумента и вызывает ее дважды:

```python
def do_twice(f):
    f()
    f()
```

---

Вот пример, который использует функцию `do_twice`, чтобы вызвать функцию под названием `print_spam` дважды:

```python
def print_spam():
    print('spam')

do_twice(print_spam)
```

---

Задание.

1.  Запишите этот пример в скрипт и протестируйте его
2.  Измените функцию `do_twice` так, чтобы она принимала 2 аргумента: объект-функцию и значение &mdash; и вызывала эту функцию дважды, передавая указанное значение в качестве ее аргумента.
3.  Скопируйте определение функции `print_twice` из сегодняшнего урока в текущий скрипт.

---

<ol class="org-ol">
<li value="4">Используйте измененную версию `do_twice`, чтобы вызвать `print_twice` дважды, передавая ей `'spam'` в качестве аргумента</li>
<li>Определите новую функцию под названием `do_four`, которая принимает объект-функцию и значение в качестве аргументов, и вызывает эту функцию 4 раза с этим значением в качестве аргумента. В теле функции `do_four` должно быть только 2 инструкции, а не 4.</li>
</ol>

---


### №3 {#3}

Напишите функцию, рисующую следующую таблицу:

```text
+ - - - - + - - - - +
|         |         |
|         |         |
|         |         |
|         |         |
+ - - - - + - - - - +
|         |         |
|         |         |
|         |         |
|         |         |
+ - - - - + - - - - +
```

---
